# To contact DataFrames

In [16]:
import pandas as pd

data1 = {"City" : ["Cairo" , "Alex" , "Benha"] ,
       "Tempreture" : [40 , 25 , 30] , 
       "Humidity" : [100 , 40 , 70]}
df1 = pd.DataFrame(data1)
df1

    City  Tempreture  Humidity
0  Cairo          40       100
1   Alex          25        40
2  Benha          30        70

In [17]:
import pandas as pd

data2 = {"City" : ["Berlin" , "Menchen" , "Humburg"] ,
       "Tempreture" : [30 , 15 , 20] , 
       "Humidity" : [60 , 20 , 30]}
df2 = pd.DataFrame(data2)
df2

      City  Tempreture  Humidity
0   Berlin          30        60
1  Menchen          15        20
2  Humburg          20        30

In [18]:
C_D_F = pd.concat([df1 , df2])
C_D_F

      City  Tempreture  Humidity
0    Cairo          40       100
1     Alex          25        40
2    Benha          30        70
0   Berlin          30        60
1  Menchen          15        20
2  Humburg          20        30

# To Handling idex DF

In [19]:
C_D_F = pd.concat([df1 , df2]  , ignore_index=True)
C_D_F

      City  Tempreture  Humidity
0    Cairo          40       100
1     Alex          25        40
2    Benha          30        70
3   Berlin          30        60
4  Menchen          15        20
5  Humburg          20        30

# To Select Cities details

In [20]:
C_D_F = pd.concat([df1 , df2]  , keys=["Egypt" , "GeRman"])
C_D_F

             City  Tempreture  Humidity
Egypt  0    Cairo          40       100
       1     Alex          25        40
       2    Benha          30        70
GeRman 0   Berlin          30        60
       1  Menchen          15        20
       2  Humburg          20        30

# TO Select Special City Details

In [21]:
C_D_F.loc["Egypt"]

    City  Tempreture  Humidity
0  Cairo          40       100
1   Alex          25        40
2  Benha          30        70

In [22]:
C_D_F.loc["GeRman"]

      City  Tempreture  Humidity
0   Berlin          30        60
1  Menchen          15        20
2  Humburg          20        30

# To ConCate Them as Columns

In [23]:
C_D_F = pd.concat([df1 , df2] , axis=1)
C_D_F

    City  Tempreture  Humidity     City  Tempreture  Humidity
0  Cairo          40       100   Berlin          30        60
1   Alex          25        40  Menchen          15        20
2  Benha          30        70  Humburg          20        30

# TO Cocate Them as Rows

In [24]:
C_D_F = pd.concat([df1 , df2])
C_D_F

      City  Tempreture  Humidity
0    Cairo          40       100
1     Alex          25        40
2    Benha          30        70
0   Berlin          30        60
1  Menchen          15        20
2  Humburg          20        30

In [25]:
C_D_F = pd.concat([df1 , df2] , axis=0)
C_D_F

      City  Tempreture  Humidity
0    Cairo          40       100
1     Alex          25        40
2    Benha          30        70
0   Berlin          30        60
1  Menchen          15        20
2  Humburg          20        30

# Addition Nwe Colume To DF

In [26]:
NC = pd.Series (["Sunny" , "Rain" , "Good"] , name="Event")
NC

0    Sunny
1     Rain
2     Good
Name: Event, dtype: object

In [30]:

data1 = {"City" : ["Cairo" , "Alex" , "Benha"] ,
       "Tempreture" : [40 , 25 , 30] , 
       "Humidity" : [100 , 40 , 70]}
df = pd.DataFrame(data1)
df

    City  Tempreture  Humidity
0  Cairo          40       100
1   Alex          25        40
2  Benha          30        70

In [35]:
C_NC = pd.concat([df , NC] , axis = 1)
C_NC

    City  Tempreture  Humidity  Event
0  Cairo          40       100  Sunny
1   Alex          25        40   Rain
2  Benha          30        70   Good